## Plan Result (sbox_landing)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 152 to add, 0 to change, 117 to destroy.</code></pre>

* Create
  * module.data_landing_zone.azurerm_key_vault_secret.log_analytics_workspace_id
  * module.data_landing_zone.azurerm_key_vault_secret.log_analytics_workspace_secret
  * module.data_landing_zone.azurerm_role_assignment.datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone.azurerm_role_assignment.datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this[&#34;curated&#34;]
  * module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this[&#34;external&#34;]
  * module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this[&#34;raw&#34;]
  * module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this[&#34;workspace&#34;]
  * module.data_landing_zone.azurerm_storage_management_policy.this[&#34;curated&#34;]
  * module.data_landing_zone.azurerm_storage_management_policy.this[&#34;external&#34;]
  * module.data_landing_zone.azurerm_storage_management_policy.this[&#34;raw&#34;]
  * module.data_landing_zone.azurerm_storage_management_policy.this[&#34;workspace&#34;]
  * module.data_landing_zone.azurerm_synapse_workspace.example
  * module.data_landing_zone.module.metadata_mssql.azurerm_mssql_database.this[&#34;dlrm-ingest-metadata-db-sbox&#34;]
  * module.data_landing_zone.module.metadata_mysql.azurerm_mysql_flexible_database.this[&#34;dlrm-ingest-HiveMetastoreDb-sbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;dlrmingestcuratedsbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;dlrmingestrawsbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;dlrm-ingest-integration-databricks001-sbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;dlrm-ingest-meta001-sbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;dlrm-ingest-metadata-mssql-sbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
  * module.data_landing_zone.module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone.module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone.module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone.module.storage[&#34;external&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone.module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone.module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone.module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone.module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone.module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp001&#34;]
  * module.data_landing_zone.module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp002&#34;]
  * module.data_landing_zone.module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
* Delete
  * module.data_landing_zone.module.metadata_mssql.azurerm_mssql_database.this[&#34;dlrm-ingest-landing-metadata-db-sbox&#34;]
  * module.data_landing_zone.module.metadata_mysql.azurerm_mysql_flexible_database.this[&#34;dlrm-ingest-landing-HiveMetastoreDb-sbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;dlrm-ingest-landing-integration-databricks001-sbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;dlring-meta001-sbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;dlrm-ingest-landing-metadata-mssql-sbox&#34;]
* Replace
  * module.data_landing_zone.azurerm_data_factory_integration_runtime_self_hosted.this
  * module.data_landing_zone.azurerm_eventhub_namespace.this
  * module.data_landing_zone.azurerm_key_vault_secret.mssql_password
  * module.data_landing_zone.azurerm_key_vault_secret.mssql_username
  * module.data_landing_zone.azurerm_key_vault_secret.mysql_connection_string
  * module.data_landing_zone.azurerm_key_vault_secret.mysql_password
  * module.data_landing_zone.azurerm_key_vault_secret.mysql_username
  * module.data_landing_zone.azurerm_log_analytics_workspace.this
  * module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.blob.core.windows.net&#34;]
  * module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dfs.core.windows.net&#34;]
  * module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.mysql.database.azure.com&#34;]
  * module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.vaultcore.azure.net&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;di001&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;di002&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;dp001&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;dp002&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;external-storage&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;logging&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;management&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;metadata&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;network&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;runtimes&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;shared-integration&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;shared-product&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;storage&#34;]
  * module.data_landing_zone.azurerm_role_assignment.datafactory_databricks
  * module.data_landing_zone.module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone.module.logging_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone.module.logging_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone.module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone.module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone.module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone.module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone.module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone.module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone.module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone.module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone.module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone.module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone.module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone.module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone.module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone.module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone.module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone.module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone.module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.deny_inbound[&#34;nsg&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-eventhub&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-sql&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-storage&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-webapp&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-inbound&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-outbound&#34;]
  * module.data_landing_zone.module.networking.azurerm_route.this[&#34;rt-default&#34;]
  * module.data_landing_zone.module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-integration-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-integration-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-product-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-product-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-services-mysql&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services&#34;]
  * module.data_landing_zone.module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_landing_zone.module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone.module.runtimes_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone.module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone.module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone.module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone.module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-curated&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-raw&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone.module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone.module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone.module.shir001.azurerm_key_vault_secret.shir_password
  * module.data_landing_zone.module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone.module.shir001.azurerm_lb_backend_address_pool.shir
  * module.data_landing_zone.module.shir001.azurerm_lb_nat_pool.shir
  * module.data_landing_zone.module.shir001.azurerm_lb_probe.shir
  * module.data_landing_zone.module.shir001.azurerm_lb_rule.shir
  * module.data_landing_zone.module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone.module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone.module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone.module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone.azurerm_data_factory_integration_runtime_self_hosted.this must be replaced
-/+ resource "azurerm_data_factory_integration_runtime_self_hosted" "this" {
      ~ data_factory_id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-runtimes-sbox/providers/Microsoft.DataFactory/factories/dlrm-ingest-landing-runtimes-dataFactory001-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ description                 = "Data Landing Zone - Self Hosted Integration Runtime running on dlrm-ingest-landing-shir001" -> "Data Landing Zone - Self Hosted Integration Runtime running on dlrm-ingest-shir001"
      ~ id                          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-runtimes-sbox/providers/Microsoft.DataFactory/factories/dlrm-ingest-landing-runtimes-dataFactory001-sbox/integrationruntimes/dlrm-ingest-landing-runtimes-dataFactory001-shir001" -> (known after apply)
      ~ name                        = "dlrm-ingest-landing-runtimes-dataFactory001-shir001" -> "dlrm-ingest-runtimes-dataFactory001-shir001" # forces replacement
      ~ primary_authorization_key   = "IR@89678735-065b-4755-8e33-de53d55016ef@dlrm-ingest-landing-runtimes-dataFactory001-sbox@ServiceEndpoint=dlrm-ingest-landing-runtimes-datafactory001-sbox.uksouth.datafactory.azure.net@h0Glw6+uC49bVqcLRJnglRJvyGfaUyzh9s2YV7Svzgw=" -> (known after apply)
      ~ secondary_authorization_key = "IR@89678735-065b-4755-8e33-de53d55016ef@dlrm-ingest-landing-runtimes-dataFactory001-sbox@ServiceEndpoint=dlrm-ingest-landing-runtimes-datafactory001-sbox.uksouth.datafactory.azure.net@w7SgVR6rfygio1DnvLvIHBZHH/KEUZoAntZdNwf1BAE=" -> (known after apply)
    }

  # module.data_landing_zone.azurerm_eventhub_namespace.this must be replaced
-/+ resource "azurerm_eventhub_namespace" "this" {
      ~ default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      ~ default_primary_key                       = (sensitive value)
      ~ default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      ~ default_secondary_key                     = (sensitive value)
      ~ id                                        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-shared-integration-sbox/providers/Microsoft.EventHub/namespaces/dlring-integration-eventHubNamespace001-sbox" -> (known after apply)
      ~ minimum_tls_version                       = "1.2" -> (known after apply)
      ~ name                                      = "dlring-integration-eventHubNamespace001-sbox" -> "dlrm-ingest-integration-eventHubNamespace001-sbox" # forces replacement
      ~ network_rulesets                          = [
          - {
              - default_action                 = "Allow"
              - ip_rule                        = []
              - public_network_access_enabled  = true
              - trusted_service_access_enabled = false
              - virtual_network_rule           = []
            },
        ] -> (known after apply)
      ~ resource_group_name                       = "dlrm-ingest-landing-shared-integration-sbox" -> "dlrm-ingest-shared-integration-sbox" # forces replacement
      ~ tags                                      = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "2df60dc3-4e03-4cf9-8d96-d63b4795d92d" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.data_landing_zone.azurerm_key_vault_secret.log_analytics_workspace_id will be created
  + resource "azurerm_key_vault_secret" "log_analytics_workspace_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dlrm-ingest-logAnalytics001-sbox-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.log_analytics_workspace_secret will be created
  + resource "azurerm_key_vault_secret" "log_analytics_workspace_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dlrm-ingest-logAnalytics001-sbox-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.mssql_password must be replaced
-/+ resource "azurerm_key_vault_secret" "mssql_password" {
      ~ id                      = "https://dlring-meta002-sbox.vault.azure.net/secrets/dlrm-ingest-landing-metadata-mssql-password-sbox/32f768a0bc96488b8c502abf8735f891" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ name                    = "dlrm-ingest-landing-metadata-mssql-password-sbox" -> "dlrm-ingest-metadata-mssql-password-sbox" # forces replacement
      ~ resource_id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox/secrets/dlrm-ingest-landing-metadata-mssql-password-sbox/versions/32f768a0bc96488b8c502abf8735f891" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox/secrets/dlrm-ingest-landing-metadata-mssql-password-sbox" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "32f768a0bc96488b8c502abf8735f891" -> (known after apply)
      ~ versionless_id          = "https://dlring-meta002-sbox.vault.azure.net/secrets/dlrm-ingest-landing-metadata-mssql-password-sbox" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.mssql_username must be replaced
-/+ resource "azurerm_key_vault_secret" "mssql_username" {
      ~ id                      = "https://dlring-meta002-sbox.vault.azure.net/secrets/dlrm-ingest-landing-metadata-mssql-username-sbox/c25a1da850a04cb6ad8bee5010444d9e" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ name                    = "dlrm-ingest-landing-metadata-mssql-username-sbox" -> "dlrm-ingest-metadata-mssql-username-sbox" # forces replacement
      ~ resource_id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox/secrets/dlrm-ingest-landing-metadata-mssql-username-sbox/versions/c25a1da850a04cb6ad8bee5010444d9e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox/secrets/dlrm-ingest-landing-metadata-mssql-username-sbox" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "c25a1da850a04cb6ad8bee5010444d9e" -> (known after apply)
      ~ versionless_id          = "https://dlring-meta002-sbox.vault.azure.net/secrets/dlrm-ingest-landing-metadata-mssql-username-sbox" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.mysql_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "mysql_connection_string" {
      ~ id                      = "https://dlring-meta002-sbox.vault.azure.net/secrets/dlrm-ingest-landing-metadata-mysql-connection-string-sbox/b697046d252e4ea0b89d40fbfa8ed6fb" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ name                    = "dlrm-ingest-landing-metadata-mysql-connection-string-sbox" -> "dlrm-ingest-metadata-mysql-connection-string-sbox" # forces replacement
      ~ resource_id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox/secrets/dlrm-ingest-landing-metadata-mysql-connection-string-sbox/versions/b697046d252e4ea0b89d40fbfa8ed6fb" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox/secrets/dlrm-ingest-landing-metadata-mysql-connection-string-sbox" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      ~ version                 = "b697046d252e4ea0b89d40fbfa8ed6fb" -> (known after apply)
      ~ versionless_id          = "https://dlring-meta002-sbox.vault.azure.net/secrets/dlrm-ingest-landing-metadata-mysql-connection-string-sbox" -> (known after apply)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.mysql_password must be replaced
-/+ resource "azurerm_key_vault_secret" "mysql_password" {
      ~ id                      = "https://dlring-meta002-sbox.vault.azure.net/secrets/dlrm-ingest-landing-metadata-mysql-password-sbox/bbb3e7c6557b4e88996a5c06cbc49422" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ name                    = "dlrm-ingest-landing-metadata-mysql-password-sbox" -> "dlrm-ingest-metadata-mysql-password-sbox" # forces replacement
      ~ resource_id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox/secrets/dlrm-ingest-landing-metadata-mysql-password-sbox/versions/bbb3e7c6557b4e88996a5c06cbc49422" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox/secrets/dlrm-ingest-landing-metadata-mysql-password-sbox" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "bbb3e7c6557b4e88996a5c06cbc49422" -> (known after apply)
      ~ versionless_id          = "https://dlring-meta002-sbox.vault.azure.net/secrets/dlrm-ingest-landing-metadata-mysql-password-sbox" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.mysql_username must be replaced
-/+ resource "azurerm_key_vault_secret" "mysql_username" {
      ~ id                      = "https://dlring-meta002-sbox.vault.azure.net/secrets/dlrm-ingest-landing-metadata-mysql-username-sbox/de6871d9a9da45bd99242f2c29a4280a" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ name                    = "dlrm-ingest-landing-metadata-mysql-username-sbox" -> "dlrm-ingest-metadata-mysql-username-sbox" # forces replacement
      ~ resource_id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox/secrets/dlrm-ingest-landing-metadata-mysql-username-sbox/versions/de6871d9a9da45bd99242f2c29a4280a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-metadata-sbox/providers/Microsoft.KeyVault/vaults/dlring-meta002-sbox/secrets/dlrm-ingest-landing-metadata-mysql-username-sbox" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "de6871d9a9da45bd99242f2c29a4280a" -> (known after apply)
      ~ versionless_id          = "https://dlring-meta002-sbox.vault.azure.net/secrets/dlrm-ingest-landing-metadata-mysql-username-sbox" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone.azurerm_log_analytics_workspace.this must be replaced
-/+ resource "azurerm_log_analytics_workspace" "this" {
      - cmk_for_query_forced            = false -> null
      ~ id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-logging-sbox/providers/Microsoft.OperationalInsights/workspaces/dlrm-ingest-landing-logAnalytics001-sbox" -> (known after apply)
      ~ name                            = "dlrm-ingest-landing-logAnalytics001-sbox" -> "dlrm-ingest-logAnalytics001-sbox" # forces replacement
      ~ primary_shared_key              = (sensitive value)
      ~ resource_group_name             = "dlrm-ingest-landing-logging-sbox" -> "dlrm-ingest-logging-sbox" # forces replacement
      ~ retention_in_days               = 30 -> (known after apply)
      ~ secondary_shared_key            = (sensitive value)
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
      ~ workspace_id                    = "88e81ca4-a91d-485d-88f5-865a7fe76f8b" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.blob.core.windows.net"] must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      ~ id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/dlrm-ingest-landing-blob-data-landing-link-sbox" -> (known after apply)
      ~ name                  = "dlrm-ingest-landing-blob-data-landing-link-sbox" -> "dlrm-ingest-blob-data-landing-link-sbox" # forces replacement
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
      ~ virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-network-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-landing-vnet-sbox" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.dfs.core.windows.net"] must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      ~ id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net/virtualNetworkLinks/dlrm-ingest-landing-dfs-data-landing-link-sbox" -> (known after apply)
      ~ name                  = "dlrm-ingest-landing-dfs-data-landing-link-sbox" -> "dlrm-ingest-dfs-data-landing-link-sbox" # forces replacement
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
      ~ virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-network-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-landing-vnet-sbox" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.mysql.database.azure.com"] must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      ~ id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com/virtualNetworkLinks/dlrm-ingest-landing-mysql-data-landing-link-sbox" -> (known after apply)
      ~ name                  = "dlrm-ingest-landing-mysql-data-landing-link-sbox" -> "dlrm-ingest-mysql-data-landing-link-sbox" # forces replacement
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
      ~ virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-network-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-landing-vnet-sbox" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.vaultcore.azure.net"] must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      ~ id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/dlrm-ingest-landing-vaultcore-data-landing-link-sbox" -> (known after apply)
      ~ name                  = "dlrm-ingest-landing-vaultcore-data-landing-link-sbox" -> "dlrm-ingest-vaultcore-data-landing-link-sbox" # forces replacement
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest"

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

tps://dlringworkspacesbox.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "dlringworkspacesbox.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://dlringworkspacesbox.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "dlringworkspacesbox.z33.web.core.windows.net" -> (known after apply)
      ~ resource_group_name               = "dlrm-ingest-landing-storage-sbox" -> "dlrm-ingest-storage-sbox" # forces replacement
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      ~ tags                              = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone.module.storage["workspace"].azurerm_storage_container.container["data"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "data"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "dlrmingestworkspacesbox"
    }

  # module.data_landing_zone.module.storage["workspace"].azurerm_storage_container.container["dp001"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "dp001"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "dlrmingestworkspacesbox"
    }

  # module.data_landing_zone.module.storage["workspace"].azurerm_storage_container.container["dp002"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "dp002"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "dlrmingestworkspacesbox"
    }

  # module.data_landing_zone.module.storage_pe["curated-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-curated-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestcuratedsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["curated-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-curated-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestcuratedsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["external-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-external-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-external-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestexternalsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["external-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-external-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-external-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestexternalsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["raw-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-raw-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestrawsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["raw-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-raw-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestrawsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["workspace-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-workspace-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestworkspacesbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["workspace-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-workspace-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestworkspacesbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone.module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "VMAdmin"
      + computer_name_prefix                              = "shir001"
      + do_not_run_extensions_on_overprovisioned_machines = false
      + enable_automatic_updates                          = true
      + extension_operations_enabled                      = (known after apply)
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = "uksouth"
      + max_bid_price                                     = -1
      + name                                              = "dlrm-ingest-shir001-vmss"
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "dlrm-ingest-runtimes-sbox"
      + scale_in_policy                                   = (known after apply)
      + single_placement_group                            = true
      + sku                                               = "Standard_D4ds_v5"
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Manual"
      + zone_balance                                      = false
      + zones                                             = [
          + "1",
        ]

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "dlrm-ingest-shir001-nic"
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = (known after apply)
              + load_balancer_inbound_nat_rules_ids    = (known after apply)
              + name                                   = "dlrm-ingest-shir001-ipconfig"
              + primary                                = true
              + subnet_id                              = (known after apply)
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }
    }

Plan: 152 to add, 0 to change, 117 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone.module.runtimes_datafactory.azurerm_data_factory.this has changed
  ~ resource "azurerm_data_factory" "this" {
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-runtimes-sbox/providers/Microsoft.DataFactory/factories/dlrm-ingest-landing-runtimes-dataFactory001-sbox"
        name                            = "dlrm-ingest-landing-runtimes-dataFactory001-sbox"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-11-08"
        }
        # (5 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory.this has changed
  ~ resource "azurerm_data_factory" "this" {
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-landing-shared-integration-sbox/providers/Microsoft.DataFactory/factories/dlrm-ingest-landing-integration-dataFactory001-sbox"
        name                            = "dlrm-ingest-landing-integration-dataFactory001-sbox"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-11-08"
        }
        # (5 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":4,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->